INSERT INTO coverbands (id, title)
VALUES (1, '000'),
       (2, 'MA''RA BAND'),
       (3, 'Pink Kode');

-- 000

INSERT INTO coverbands_songs_relations (cover_band_id, song_id, key_signature, status)
VALUES (1, 51, -2, 1),
       (1, 52, 0, 1),
       (1, 53, 1, NULL),
       (1, 4, -4, 1),
       (1, 54, 0, 1),
       (1, 55, 1, 1),
       (1, 56, 2, 1),
       (1, 41, 0, 1),
       (1, 57, 0, 1),
       (1, 47, 2, 1),
       (1, 42, 0, 1),
       (1, 58, 1, 1),
       (1, 59, 4, 1),
       (1, 60, 0, 1),
       (1, 61, 1, 1),
       (1, 62, 1, 1),
       (1, 63, -1, 1),
       (1, 64, -1, 1),
       (1, 65, 0, NULL);

-- MA'RA BAND

INSERT INTO coverbands_songs_relations (cover_band_id, song_id, key_signature, status)
VALUES (2, 47, -3, 1),
       (2, 66, -4, 1),
       (2, 67, 1, 1),
       (2, 68, 0, 1),
       (2, 69, 6, 1);

-- Pink Kode

INSERT INTO coverbands_songs_relations (cover_band_id, song_id, key_signature, status)
VALUES (3, 1, 4, 1),
       (3, 2, 2, 2),
       (3, 3, -1, 1),
       (3, 4, 4, 2),
       (3, 5, 2, 1),
       (3, 6, 4, 1),
       (3, 7, 1, 1),
       (3, 8, -3, 2),
       (3, 9, -4, 1),
       (3, 10, -2, 1),
       (3, 11, 1, 1),
       (3, 12, 1, 2),
       (3, 13, 2, 1),
       (3, 14, NULL, 1),
       (3, 15, -2, 1),
       (3, 16, 4, 1),
       (3, 17, -3, 1),
       (3, 18, -1, 1),
       (3, 19, -3, 1),
       (3, 20, 5, 1),
       (3, 21, NULL, 1),
       (3, 22, 0, 1),
       (3, 23, 3, 1),
       (3, 24, -3, 1),
       (3, 25, 1, 1),
       (3, 26, 4, 1),
       (3, 27, 5, 1),
       (3, 28, 0, 1),
       (3, 29, 0, 1),
       (3, 30, -3, 1),
       (3, 31, -1, 1),
       (3, 32, -3, 1),
       (3, 33, -7, 1),
       (3, 34, -3, 1),
       (3, 35, -1, 1),
       (3, 36, 4, 1),
       (3, 37, 2, 2),
       (3, 38, -1, 1),
       (3, 39, -2, 1),
       (3, 40, -1, 1),
       (3, 41, 2, 1),
       (3, 42, 7, 1),
       (3, 43, -1, 1),
       (3, 44, -4, 1),
       (3, 45, 2, 1),
       (3, 46, -4, 1),
       (3, 47, 0, 1),
       (3, 48, -3, 1);

INSERT INTO performances (id, title, location, date)
VALUES (1, null, 'Минск, ул.Октябрьская', '2018-12-01 19:00'),
       (2, null, 'Минск, ул.Зыбицкая', '2018-12-02 19:00'),
       (3, null, 'Санкт-Петербург, ул.Набережная канала Грибоедова', '2018-12-03 19:00'),
       (4, null, 'Санкт-Петербург, ул.Дворцовая набережная', '2018-12-04 19:00');