INSERT INTO coverbands (id, title)
VALUES (1, '000'),
       (2, 'Pink Kode');

-- 000

INSERT INTO coverbands_songs_relations (cover_band_id, song_id, key_signature, status)
VALUES (1, 51, -2, 1),
       (1, 52, 0, 1),
       (1, 53, 1, NULL),
       (1, 4, -4, 1),
       (1, 54, 0, 1),
       (1, 55, 1, 1),
       (1, 56, 2, 1),
       (1, 41, 0, 1),
       (1, 57, 0, 1),
       (1, 47, 2, 1),
       (1, 42, 0, 1);

-- Pink Kode

INSERT INTO coverbands_songs_relations (cover_band_id, song_id, key_signature, status)
VALUES (2, 1, 4, 1),
       (2, 2, 2, 2),
       (2, 3, -1, 1),
       (2, 4, 4, 2),
       (2, 5, 2, 1),
       (2, 6, 4, 1),
       (2, 7, 1, 1),
       (2, 8, -3, 2),
       (2, 9, -4, 1),
       (2, 10, -2, 1),
       (2, 11, 1, 1),
       (2, 12, 1, 2),
       (2, 13, 2, 1),
       (2, 14, NULL, 1),
       (2, 15, -2, 1),
       (2, 16, 4, 1),
       (2, 17, -3, 1),
       (2, 18, -1, 1),
       (2, 19, -3, 1),
       (2, 20, 5, 1),
       (2, 21, NULL, 1),
       (2, 22, 0, 1),
       (2, 23, 3, 1),
       (2, 24, -3, 1),
       (2, 25, 1, 1),
       (2, 26, 4, 1),
       (2, 27, 5, 1),
       (2, 28, 0, 1),
       (2, 29, 0, 1),
       (2, 30, -3, 1),
       (2, 31, -1, 1),
       (2, 32, -3, 1),
       (2, 33, -7, 1),
       (2, 34, -3, 1),
       (2, 35, -1, 1),
       (2, 36, 4, 1),
       (2, 37, 2, 2),
       (2, 38, -1, 1),
       (2, 39, -2, 1),
       (2, 40, -1, 1),
       (2, 41, 2, 1),
       (2, 42, 7, 1),
       (2, 43, -1, 1),
       (2, 44, -4, 1),
       (2, 45, 2, 1),
       (2, 46, -4, 1),
       (2, 47, 0, 1),
       (2, 48, -3, 1);

INSERT INTO performances (id, title, location, date)
VALUES (1, null, 'Минск, ул.Октябрьская', '2018-12-01 19:00'),
       (2, null, 'Минск, ул.Зыбицкая', '2018-12-02 19:00'),
       (3, null, 'Санкт-Петербург, ул.Набережная канала Грибоедова', '2018-12-03 19:00'),
       (4, null, 'Санкт-Петербург, ул.Дворцовая набережная', '2018-12-04 19:00');